class YTData {
  var vidList = {
    0: [
      'سورة ال عمران الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '7,340,803',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '15:53',
      'assets/vids/video.mp4'
    ],
    1: [
      'سورة البقرة الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '10,892',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '21:29',
      'assets/vids/video.mp4'
    ],
    2: [
      'سورة المزمل الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '110',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '4:17',
      'assets/vids/video.mp4'
    ],
    3: [
      'سورة الكهف الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '510,690',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '14:53',
      'assets/vids/video.mp4'
    ],
    4: [
      'سورة محمد الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '4.8M',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '4:08',
      'assets/vids/video.mp4'
    ],
    5: [
      'سورة يوسف الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '10,297',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '8:27',
      'assets/vids/video.mp4'
    ],
    6: [
      'سورة يس الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '184',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '4:06',
      'assets/vids/video.mp4'
    ],
    7: [
      'سورة النور الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '39,433,213',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '17:53',
      'assets/vids/video.mp4'
    ],
    8: [
      'سورة الفجر الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '13K',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '4:48',
      'assets/vids/video.mp4'
    ],
    9: [
      'سورة الرحمن الشيخ عبد الباسط عبد الصمد القران الكريم',
      'images/صوره عبد الباسط.jpg',
      'قناه الشيخ عبد الباسط',
      '23M',
      ' 15 يونيو،2024',
      'images/عبد الباسط profile pic.jpg',
      '12:35',
      'assets/vids/video.mp4'
    ],
  };

  var shortsList = {
    0: [
      'عبد الباسط عبد الصمد',
      'images/smiley.jpg',
      'assets/vids/video.mp4',
      'The glittering but calm water reminds me of sanity',
      '20M',
      '20K',
      '##فيديوهات إسلامية #أمير منير #إسلاميات'
    ],
    1: [
      'امير منير',
      'images/woman1.png',
      'assets/vids/video.mp4',
      'Awesome rubiks cube',
      '2.5K',
      '100',
      '##فيديوهات إسلامية #أمير منير #إسلاميات'
    ],
    2: [
      '@Yasser mamdouh',
      'images/cat.jpg',
      'assets/vids/video.mp4',
      'هذا النص هو نص يمكن أن يستبدل بنص اخر  هذا النص هو نص يمكن أن يستبدل بنص اخر',
      '250k',
      '100K',
      '##فيديوهات إسلامية #أمير منير #إسلاميات'
    ],
    3: [
      'the holy quran',
      'images/profile_pic2.jpg',
      'assets/vids/video.mp4',
      'Life in an alternate universe',
      '10M',
      '30K',
      '##فيديوهات إسلامية #أمير منير #إسلاميات'
    ]
  };
}
